Revit 2026 API

# Transform2DAlmostEqual Method

---

Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AlmostEqual(
	Transform2D right
)
```
```vb
Public Function AlmostEqual (
	right As Transform2D
) As Boolean
```
```cpp
public:
bool AlmostEqual(
	Transform2D^ right
)
```
```fsharp
member AlmostEqual :
        right : Transform2D -> bool
```

#### Parameters

right Transform2D
     The transformation to compare with this transformation.

#### Return Value

Boolean True if the two transformations are equal, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The tolerance is applied memberwise for comparison.

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace